MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS708/mcu.h
#define ADCON2H ADCON2H
extern volatile uint16_t ADCON2H __attribute__((__sfr__));
__extension__ typedef struct tagADCON2HBITS {
  union {
    struct {
      uint16_t SHRSAMC:10;
      uint16_t :4;
      uint16_t REFERR:1;
      uint16_t REFRDY:1;
    };
    struct {
      uint16_t SHRSAMC0:1;
      uint16_t SHRSAMC1:1;
      uint16_t SHRSAMC2:1;
      uint16_t SHRSAMC3:1;
      uint16_t SHRSAMC4:1;
      uint16_t SHRSAMC5:1;
      uint16_t SHRSAMC6:1;
      uint16_t SHRSAMC7:1;
      uint16_t SHRSAMC8:1;
      uint16_t SHRSAMC9:1;
    };
  };
} ADCON2HBITS;
extern volatile ADCON2HBITS ADCON2Hbits __attribute__((__sfr__));

#define ADCON3L ADCON3L
extern volatile uint16_t ADCON3L __attribute__((__sfr__));
__extension__ typedef struct tagADCON3LBITS {
  union {
    struct {
      uint16_t CNVCHSEL:6;
      uint16_t SWCTRG:1;
      uint16_t SWLCTRG:1;
      uint16_t CNVRTCH:1;
      uint16_t SHRSAMP:1;
      uint16_t SUSPRDY:1;
      uint16_t SUSPCIE:1;
      uint16_t SUSPEND:1;
      uint16_t REFSEL:3;
    };
    struct {
      uint16_t CNVCHSEL0:1;
      uint16_t CNVCHSEL1:1;
      uint16_t CNVCHSEL2:1;
      uint16_t CNVCHSEL3:1;
      uint16_t CNVCHSEL4:1;
      uint16_t CNVCHSEL5:1;
      uint16_t :7;
      uint16_t REFSEL0:1;
      uint16_t REFSEL1:1;
      uint16_t REFSEL2:1;
    };
  };
} ADCON3LBITS;
extern volatile ADCON3LBITS ADCON3Lbits __attribute__((__sfr__));

#define ADCON3H ADCON3H
extern volatile uint16_t ADCON3H __attribute__((__sfr__));
__extension__ typedef struct tagADCON3HBITS {
  union {
    struct {
      uint16_t C0EN:1;
      uint16_t C1EN:1;
      uint16_t C2EN:1;
      uint16_t C3EN:1;
      uint16_t :3;
      uint16_t SHREN:1;
      uint16_t CLKDIV:6;
      uint16_t CLKSEL:2;
    };
    struct {
      uint16_t :8;
      uint16_t CLKDIV0:1;
      uint16_t CLKDIV1:1;
      uint16_t CLKDIV2:1;
      uint16_t CLKDIV3:1;
      uint16_t CLKDIV4:1;
      uint16_t CLKDIV5:1;
      uint16_t CLKSEL0:1;
      uint16_t CLKSEL1:1;
    };
  };
} ADCON3HBITS;
extern volatile ADCON3HBITS ADCON3Hbits __attribute__((__sfr__));

#define ADCON4L ADCON4L
extern volatile uint16_t ADCON4L __attribute__((__sfr__));
typedef struct tagADCON4LBITS {
  uint16_t SAMC0EN:1;
  uint16_t SAMC1EN:1;
  uint16_t SAMC2EN:1;
  uint16_t SAMC3EN:1;
  uint16_t :4;
  uint16_t SYNCTRG0:1;
  uint16_t SYNCTRG1:1;
  uint16_t SYNCTRG2:1;
  uint16_t SYNCTRG3:1;
} ADCON4LBITS;
extern volatile ADCON4LBITS ADCON4Lbits __attribute__((__sfr__));

#define ADCON4H ADCON4H
extern volatile uint16_t ADCON4H __attribute__((__sfr__));
__extension__ typedef struct tagADCON4HBITS {
  union {
    struct {
      uint16_t C0CHS:2;
      uint16_t C1CHS:2;
      uint16_t C2CHS:2;
      uint16_t C3CHS:2;
    };
    struct {
      uint16_t C0CHS0:1;
      uint16_t C0CHS1:1;
      uint16_t C1CHS0:1;
      uint16_t C1CHS1:1;
      uint16_t C2CHS0:1;
      uint16_t C2CHS1:1;
      uint16_t C3CHS0:1;
      uint16_t C3CHS1:1;
    };
  };
} ADCON4HBITS;
extern volatile ADCON4HBITS ADCON4Hbits __attribute__((__sfr__));

#define ADMOD0L ADMOD0L
extern volatile uint16_t ADMOD0L __attribute__((__sfr__));
typedef struct tagADMOD0LBITS {
  uint16_t SIGN0:1;
  uint16_t DIFF0:1;
  uint16_t SIGN1:1;
  uint16_t DIFF1:1;
  uint16_t SIGN2:1;
  uint16_t DIFF2:1;
  uint16_t SIGN3:1;
  uint16_t DIFF3:1;
  uint16_t SIGN4:1;
  uint16_t DIFF4:1;
  uint16_t SIGN5:1;
  uint16_t DIFF5:1;
  uint16_t SIGN6:1;
  uint16_t DIFF6:1;
  uint16_t SIGN7:1;
  uint16_t DIFF7:1;
} ADMOD0LBITS;
extern volatile ADMOD0LBITS ADMOD0Lbits __attribute__((__sfr__));

#define ADMOD0H ADMOD0H
extern volatile uint16_t ADMOD0H __attribute__((__sfr__));
typedef struct tagADMOD0HBITS {
  uint16_t SIGN8:1;
  uint16_t DIFF8:1;
  uint16_t SIGN9:1;
  uint16_t DIFF9:1;
  uint16_t SIGN10:1;
  uint16_t DIFF10:1;
  uint16_t SIGN11:1;
  uint16_t DIFF11:1;
  uint16_t SIGN12:1;
  uint16_t DIFF12:1;
  uint16_t SIGN13:1;
  uint16_t DIFF13:1;
  uint16_t SIGN14:1;
  uint16_t DIFF14:1;
  uint16_t SIGN15:1;
  uint16_t DIFF15:1;
} ADMOD0HBITS;
extern volatile ADMOD0HBITS ADMOD0Hbits __attribute__((__sfr__));

#define ADMOD1L ADMOD1L
extern volatile uint16_t ADMOD1L __attribute__((__sfr__));
typedef struct tagADMOD1LBITS {
  uint16_t SIGN16:1;
  uint16_t DIFF16:1;
  uint16_t SIGN17:1;
  uint16_t DIFF17:1;
  uint16_t SIGN18:1;
  uint16_t DIFF18:1;
  uint16_t SIGN19:1;
  uint16_t DIFF19:1;
  uint16_t SIGN20:1;
  uint16_t DIFF20:1;
  uint16_t SIGN21:1;
  uint16_t DIFF21:1;
} ADMOD1LBITS;
extern volatile ADMOD1LBITS ADMOD1Lbits __attribute__((__sfr__));

#define ADIEL ADIEL
extern volatile uint16_t ADIEL __attribute__((__sfr__));
typedef struct tagADIELBITS {
  uint16_t IE0:1;
  uint16_t IE1:1;
  uint16_t IE2:1;
  uint16_t IE3:1;
  uint16_t IE4:1;
  uint16_t IE5:1;
  uint16_t IE6:1;
  uint16_t IE7:1;
  uint16_t IE8:1;
  uint16_t IE9:1;
  uint16_t IE10:1;
  uint16_t IE11:1;
  uint16_t IE12:1;
  uint16_t IE13:1;
  uint16_t IE14:1;
  uint16_t IE15:1;
} ADIELBITS;
extern volatile ADIELBITS ADIELbits __attribute__((__sfr__));

#define ADIEH ADIEH
extern volatile uint16_t ADIEH __attribute__((__sfr__));
typedef struct tagADIEHBITS {
  uint16_t IE16:1;
  uint16_t IE17:1;
  uint16_t IE18:1;
  uint16_t IE19:1;
  uint16_t IE20:1;
  uint16_t IE21:1;
} ADIEHBITS;
extern volatile ADIEHBITS ADIEHbits __attribute__((__sfr__));

#define ADCSSL ADCSSL
extern volatile uint16_t ADCSSL __attribute__((__sfr__));
typedef struct tagADCSSLBITS {
  uint16_t CSS0:1;
  uint16_t CSS1:1;
  uint16_t CSS2:1;
  uint16_t CSS3:1;
  uint16_t CSS4:1;
  uint16_t CSS5:1;
  uint16_t CSS6:1;
  uint16_t CSS7:1;
  uint16_t CSS8:1;
  uint16_t CSS9:1;
  uint16_t CSS10:1;
  uint16_t CSS11:1;
  uint16_t CSS12:1;
  uint16_t CSS13:1;
  uint16_t CSS14:1;
  uint16_t CSS15:1;
} ADCSSLBITS;
extern volatile ADCSSLBITS ADCSSLbits __attribute__((__sfr__));

#define ADCSSH ADCSSH
extern volatile uint16_t ADCSSH __attribute__((__sfr__));
typedef struct tagADCSSHBITS {
  uint16_t CSS16:1;
  uint16_t CSS17:1;
  uint16_t CSS18:1;
  uint16_t CSS19:1;
  uint16_t CSS20:1;
  uint16_t CSS21:1;
} ADCSSHBITS;
extern volatile ADCSSHBITS ADCSSHbits __attribute__((__sfr__));

