MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS708/mcu.h
#define ADSTATL ADSTATL
extern volatile uint16_t ADSTATL __attribute__((__sfr__));
typedef struct tagADSTATLBITS {
  uint16_t AN0RDY:1;
  uint16_t AN1RDY:1;
  uint16_t AN2RDY:1;
  uint16_t AN3RDY:1;
  uint16_t AN4RDY:1;
  uint16_t AN5RDY:1;
  uint16_t AN6RDY:1;
  uint16_t AN7RDY:1;
  uint16_t AN8RDY:1;
  uint16_t AN9RDY:1;
  uint16_t AN10RDY:1;
  uint16_t AN11RDY:1;
  uint16_t AN12RDY:1;
  uint16_t AN13RDY:1;
  uint16_t AN14RDY:1;
  uint16_t AN15RDY:1;
} ADSTATLBITS;
extern volatile ADSTATLBITS ADSTATLbits __attribute__((__sfr__));

#define ADSTATH ADSTATH
extern volatile uint16_t ADSTATH __attribute__((__sfr__));
typedef struct tagADSTATHBITS {
  uint16_t AN16RDY:1;
  uint16_t AN17RDY:1;
  uint16_t AN18RDY:1;
  uint16_t AN19RDY:1;
  uint16_t AN20RDY:1;
  uint16_t AN21RDY:1;
} ADSTATHBITS;
extern volatile ADSTATHBITS ADSTATHbits __attribute__((__sfr__));

#define ADCMP0ENL ADCMP0ENL
extern volatile uint16_t ADCMP0ENL __attribute__((__sfr__));
typedef struct tagADCMP0ENLBITS {
  uint16_t CMPEN0:1;
  uint16_t CMPEN1:1;
  uint16_t CMPEN2:1;
  uint16_t CMPEN3:1;
  uint16_t CMPEN4:1;
  uint16_t CMPEN5:1;
  uint16_t CMPEN6:1;
  uint16_t CMPEN7:1;
  uint16_t CMPEN8:1;
  uint16_t CMPEN9:1;
  uint16_t CMPEN10:1;
  uint16_t CMPEN11:1;
  uint16_t CMPEN12:1;
  uint16_t CMPEN13:1;
  uint16_t CMPEN14:1;
  uint16_t CMPEN15:1;
} ADCMP0ENLBITS;
extern volatile ADCMP0ENLBITS ADCMP0ENLbits __attribute__((__sfr__));

#define ADCMP0ENH ADCMP0ENH
extern volatile uint16_t ADCMP0ENH __attribute__((__sfr__));
typedef struct tagADCMP0ENHBITS {
  uint16_t CMPEN16:1;
  uint16_t CMPEN17:1;
  uint16_t CMPEN18:1;
  uint16_t CMPEN19:1;
  uint16_t CMPEN20:1;
  uint16_t CMPEN21:1;
} ADCMP0ENHBITS;
extern volatile ADCMP0ENHBITS ADCMP0ENHbits __attribute__((__sfr__));

#define ADCMP0LO ADCMP0LO
extern volatile uint16_t ADCMP0LO __attribute__((__sfr__));
#define ADCMP0HI ADCMP0HI
extern volatile uint16_t ADCMP0HI __attribute__((__sfr__));
#define ADCMP1ENL ADCMP1ENL
extern volatile uint16_t ADCMP1ENL __attribute__((__sfr__));
typedef struct tagADCMP1ENLBITS {
  uint16_t CMPEN0:1;
  uint16_t CMPEN1:1;
  uint16_t CMPEN2:1;
  uint16_t CMPEN3:1;
  uint16_t CMPEN4:1;
  uint16_t CMPEN5:1;
  uint16_t CMPEN6:1;
  uint16_t CMPEN7:1;
  uint16_t CMPEN8:1;
  uint16_t CMPEN9:1;
  uint16_t CMPEN10:1;
  uint16_t CMPEN11:1;
  uint16_t CMPEN12:1;
  uint16_t CMPEN13:1;
  uint16_t CMPEN14:1;
  uint16_t CMPEN15:1;
} ADCMP1ENLBITS;
extern volatile ADCMP1ENLBITS ADCMP1ENLbits __attribute__((__sfr__));

#define ADCMP1ENH ADCMP1ENH
extern volatile uint16_t ADCMP1ENH __attribute__((__sfr__));
typedef struct tagADCMP1ENHBITS {
  uint16_t CMPEN16:1;
  uint16_t CMPEN17:1;
  uint16_t CMPEN18:1;
  uint16_t CMPEN19:1;
  uint16_t CMPEN20:1;
  uint16_t CMPEN21:1;
} ADCMP1ENHBITS;
extern volatile ADCMP1ENHBITS ADCMP1ENHbits __attribute__((__sfr__));

#define ADCMP1LO ADCMP1LO
extern volatile uint16_t ADCMP1LO __attribute__((__sfr__));
#define ADCMP1HI ADCMP1HI
extern volatile uint16_t ADCMP1HI __attribute__((__sfr__));
#define ADFL0DAT ADFL0DAT
extern volatile uint16_t ADFL0DAT __attribute__((__sfr__));
#define ADFL0CON ADFL0CON
extern volatile uint16_t ADFL0CON __attribute__((__sfr__));
__extension__ typedef struct tagADFL0CONBITS {
  union {
    struct {
      uint16_t FLCHSEL:5;
      uint16_t :3;
      uint16_t RDY:1;
      uint16_t IE:1;
      uint16_t OVRSAM:3;
      uint16_t MODE:2;
      uint16_t FLEN:1;
    };
    struct {
      uint16_t FLCHSEL0:1;
      uint16_t FLCHSEL1:1;
      uint16_t FLCHSEL2:1;
      uint16_t FLCHSEL3:1;
      uint16_t FLCHSEL4:1;
      uint16_t :5;
      uint16_t OVRSAM0:1;
      uint16_t OVRSAM1:1;
      uint16_t OVRSAM2:1;
    };
  };
} ADFL0CONBITS;
extern volatile ADFL0CONBITS ADFL0CONbits __attribute__((__sfr__));

#define ADFL1DAT ADFL1DAT
extern volatile uint16_t ADFL1DAT __attribute__((__sfr__));
#define ADFL1CON ADFL1CON
extern volatile uint16_t ADFL1CON __attribute__((__sfr__));
__extension__ typedef struct tagADFL1CONBITS {
  union {
    struct {
      uint16_t FLCHSEL:5;
      uint16_t :3;
      uint16_t RDY:1;
      uint16_t IE:1;
      uint16_t OVRSAM:3;
      uint16_t MODE:2;
      uint16_t FLEN:1;
    };
    struct {
      uint16_t FLCHSEL0:1;
      uint16_t FLCHSEL1:1;
      uint16_t FLCHSEL2:1;
      uint16_t FLCHSEL3:1;
      uint16_t FLCHSEL4:1;
      uint16_t :5;
      uint16_t OVRSAM0:1;
      uint16_t OVRSAM1:1;
      uint16_t OVRSAM2:1;
    };
  };
} ADFL1CONBITS;
extern volatile ADFL1CONBITS ADFL1CONbits __attribute__((__sfr__));

#define ADTRIG0L ADTRIG0L
extern volatile uint16_t ADTRIG0L __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG0LBITS {
  union {
    struct {
      uint16_t TRGSRC0:5;
      uint16_t :3;
      uint16_t TRGSRC1:5;
    };
    struct {
      uint16_t TRIGSRC00:1;
      uint16_t TRIGSRC01:1;
      uint16_t TRIGSRC02:1;
      uint16_t TRIGSRC03:1;
      uint16_t TRIGSRC04:1;
      uint16_t :3;
      uint16_t TRGSRC10:1;
      uint16_t TRGSRC11:1;
      uint16_t TRGSRC12:1;
      uint16_t TRGSRC13:1;
      uint16_t TRGSRC14:1;
    };
    struct {
      uint16_t TRGSRC00:1;
      uint16_t TRGSRC01:1;
      uint16_t TRGSRC02:1;
      uint16_t TRGSRC03:1;
      uint16_t TRGSRC04:1;
    };
  };
} ADTRIG0LBITS;
extern volatile ADTRIG0LBITS ADTRIG0Lbits __attribute__((__sfr__));

#define ADTRIG0H ADTRIG0H
extern volatile uint16_t ADTRIG0H __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG0HBITS {
  union {
    struct {
      uint16_t TRGSRC2:5;
      uint16_t :3;
      uint16_t TRGSRC3:5;
    };
    struct {
      uint16_t TRIGSRC20:1;
      uint16_t TRIGSRC21:1;
      uint16_t TRIGSRC22:1;
      uint16_t TRIGSRC23:1;
      uint16_t TRIGSRC24:1;
      uint16_t :3;
      uint16_t TRGSRC30:1;
      uint16_t TRGSRC31:1;
      uint16_t TRGSRC32:1;
      uint16_t TRGSRC33:1;
      uint16_t TRGSRC34:1;
    };
    struct {
      uint16_t TRGSRC20:1;
      uint16_t TRGSRC21:1;
      uint16_t TRGSRC22:1;
      uint16_t TRGSRC23:1;
      uint16_t TRGSRC24:1;
    };
  };
} ADTRIG0HBITS;
extern volatile ADTRIG0HBITS ADTRIG0Hbits __attribute__((__sfr__));

