MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS708/mcu.h
#define _IPC24_PWM3IP0_POSITION                  0x00000000
#define _IPC24_PWM3IP0_MASK                      0x00000001
#define _IPC24_PWM3IP0_LENGTH                    0x00000001

#define _IPC24_PWM3IP1_POSITION                  0x00000001
#define _IPC24_PWM3IP1_MASK                      0x00000002
#define _IPC24_PWM3IP1_LENGTH                    0x00000001

#define _IPC24_PWM3IP2_POSITION                  0x00000002
#define _IPC24_PWM3IP2_MASK                      0x00000004
#define _IPC24_PWM3IP2_LENGTH                    0x00000001

#define _IPC24_PWM4IP0_POSITION                  0x00000004
#define _IPC24_PWM4IP0_MASK                      0x00000010
#define _IPC24_PWM4IP0_LENGTH                    0x00000001

#define _IPC24_PWM4IP1_POSITION                  0x00000005
#define _IPC24_PWM4IP1_MASK                      0x00000020
#define _IPC24_PWM4IP1_LENGTH                    0x00000001

#define _IPC24_PWM4IP2_POSITION                  0x00000006
#define _IPC24_PWM4IP2_MASK                      0x00000040
#define _IPC24_PWM4IP2_LENGTH                    0x00000001

#define _IPC24_PWM5IP0_POSITION                  0x00000008
#define _IPC24_PWM5IP0_MASK                      0x00000100
#define _IPC24_PWM5IP0_LENGTH                    0x00000001

#define _IPC24_PWM5IP1_POSITION                  0x00000009
#define _IPC24_PWM5IP1_MASK                      0x00000200
#define _IPC24_PWM5IP1_LENGTH                    0x00000001

#define _IPC24_PWM5IP2_POSITION                  0x0000000A
#define _IPC24_PWM5IP2_MASK                      0x00000400
#define _IPC24_PWM5IP2_LENGTH                    0x00000001

#define _IPC24_PWM6IP0_POSITION                  0x0000000C
#define _IPC24_PWM6IP0_MASK                      0x00001000
#define _IPC24_PWM6IP0_LENGTH                    0x00000001

#define _IPC24_PWM6IP1_POSITION                  0x0000000D
#define _IPC24_PWM6IP1_MASK                      0x00002000
#define _IPC24_PWM6IP1_LENGTH                    0x00000001

#define _IPC24_PWM6IP2_POSITION                  0x0000000E
#define _IPC24_PWM6IP2_MASK                      0x00004000
#define _IPC24_PWM6IP2_LENGTH                    0x00000001

#define _IPC25_PWM7IP_POSITION                   0x00000000
#define _IPC25_PWM7IP_MASK                       0x00000007
#define _IPC25_PWM7IP_LENGTH                     0x00000003

#define _IPC25_PWM8IP_POSITION                   0x00000004
#define _IPC25_PWM8IP_MASK                       0x00000070
#define _IPC25_PWM8IP_LENGTH                     0x00000003

#define _IPC25_AC2IP_POSITION                    0x0000000C
#define _IPC25_AC2IP_MASK                        0x00007000
#define _IPC25_AC2IP_LENGTH                      0x00000003

#define _IPC25_PWM7IP0_POSITION                  0x00000000
#define _IPC25_PWM7IP0_MASK                      0x00000001
#define _IPC25_PWM7IP0_LENGTH                    0x00000001

#define _IPC25_PWM7IP1_POSITION                  0x00000001
#define _IPC25_PWM7IP1_MASK                      0x00000002
#define _IPC25_PWM7IP1_LENGTH                    0x00000001

#define _IPC25_PWM7IP2_POSITION                  0x00000002
#define _IPC25_PWM7IP2_MASK                      0x00000004
#define _IPC25_PWM7IP2_LENGTH                    0x00000001

#define _IPC25_PWM8IP0_POSITION                  0x00000004
#define _IPC25_PWM8IP0_MASK                      0x00000010
#define _IPC25_PWM8IP0_LENGTH                    0x00000001

#define _IPC25_PWM8IP1_POSITION                  0x00000005
#define _IPC25_PWM8IP1_MASK                      0x00000020
#define _IPC25_PWM8IP1_LENGTH                    0x00000001

#define _IPC25_PWM8IP2_POSITION                  0x00000006
#define _IPC25_PWM8IP2_MASK                      0x00000040
#define _IPC25_PWM8IP2_LENGTH                    0x00000001

#define _IPC25_AC2IP0_POSITION                   0x0000000C
#define _IPC25_AC2IP0_MASK                       0x00001000
#define _IPC25_AC2IP0_LENGTH                     0x00000001

#define _IPC25_AC2IP1_POSITION                   0x0000000D
#define _IPC25_AC2IP1_MASK                       0x00002000
#define _IPC25_AC2IP1_LENGTH                     0x00000001

#define _IPC25_AC2IP2_POSITION                   0x0000000E
#define _IPC25_AC2IP2_MASK                       0x00004000
#define _IPC25_AC2IP2_LENGTH                     0x00000001

#define _IPC25_CMP2IP_POSITION                   0x0000000C
#define _IPC25_CMP2IP_MASK                       0x00007000
#define _IPC25_CMP2IP_LENGTH                     0x00000003

#define _IPC25_CMP2IP0_POSITION                  0x0000000C
#define _IPC25_CMP2IP0_MASK                      0x00001000
#define _IPC25_CMP2IP0_LENGTH                    0x00000001

#define _IPC25_CMP2IP1_POSITION                  0x0000000D
#define _IPC25_CMP2IP1_MASK                      0x00002000
#define _IPC25_CMP2IP1_LENGTH                    0x00000001

#define _IPC25_CMP2IP2_POSITION                  0x0000000E
#define _IPC25_CMP2IP2_MASK                      0x00004000
#define _IPC25_CMP2IP2_LENGTH                    0x00000001

#define _IPC26_AC3IP_POSITION                    0x00000000
#define _IPC26_AC3IP_MASK                        0x00000007
#define _IPC26_AC3IP_LENGTH                      0x00000003

#define _IPC26_AC4IP_POSITION                    0x00000004
#define _IPC26_AC4IP_MASK                        0x00000070
#define _IPC26_AC4IP_LENGTH                      0x00000003

#define _IPC26_AC3IP0_POSITION                   0x00000000
#define _IPC26_AC3IP0_MASK                       0x00000001
#define _IPC26_AC3IP0_LENGTH                     0x00000001

#define _IPC26_AC3IP1_POSITION                   0x00000001
#define _IPC26_AC3IP1_MASK                       0x00000002
#define _IPC26_AC3IP1_LENGTH                     0x00000001

#define _IPC26_AC3IP2_POSITION                   0x00000002
#define _IPC26_AC3IP2_MASK                       0x00000004
#define _IPC26_AC3IP2_LENGTH                     0x00000001

#define _IPC26_AC4IP0_POSITION                   0x00000004
#define _IPC26_AC4IP0_MASK                       0x00000010
#define _IPC26_AC4IP0_LENGTH                     0x00000001

#define _IPC26_AC4IP1_POSITION                   0x00000005
#define _IPC26_AC4IP1_MASK                       0x00000020
#define _IPC26_AC4IP1_LENGTH                     0x00000001

#define _IPC26_AC4IP2_POSITION                   0x00000006
#define _IPC26_AC4IP2_MASK                       0x00000040
#define _IPC26_AC4IP2_LENGTH                     0x00000001

#define _IPC26_CMP3IP_POSITION                   0x00000000
#define _IPC26_CMP3IP_MASK                       0x00000007
#define _IPC26_CMP3IP_LENGTH                     0x00000003

#define _IPC26_CMP4IP_POSITION                   0x00000004
#define _IPC26_CMP4IP_MASK                       0x00000070
#define _IPC26_CMP4IP_LENGTH                     0x00000003

