MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP64GS708/mcu.h
#define _IOCON8_SWAP_POSITION                    0x00000001
#define _IOCON8_SWAP_MASK                        0x00000002
#define _IOCON8_SWAP_LENGTH                      0x00000001

#define _IOCON8_CLDAT_POSITION                   0x00000002
#define _IOCON8_CLDAT_MASK                       0x0000000C
#define _IOCON8_CLDAT_LENGTH                     0x00000002

#define _IOCON8_FLTDAT_POSITION                  0x00000004
#define _IOCON8_FLTDAT_MASK                      0x00000030
#define _IOCON8_FLTDAT_LENGTH                    0x00000002

#define _IOCON8_OVRDAT_POSITION                  0x00000006
#define _IOCON8_OVRDAT_MASK                      0x000000C0
#define _IOCON8_OVRDAT_LENGTH                    0x00000002

#define _IOCON8_OVRENL_POSITION                  0x00000008
#define _IOCON8_OVRENL_MASK                      0x00000100
#define _IOCON8_OVRENL_LENGTH                    0x00000001

#define _IOCON8_OVRENH_POSITION                  0x00000009
#define _IOCON8_OVRENH_MASK                      0x00000200
#define _IOCON8_OVRENH_LENGTH                    0x00000001

#define _IOCON8_PMOD_POSITION                    0x0000000A
#define _IOCON8_PMOD_MASK                        0x00000C00
#define _IOCON8_PMOD_LENGTH                      0x00000002

#define _IOCON8_POLL_POSITION                    0x0000000C
#define _IOCON8_POLL_MASK                        0x00001000
#define _IOCON8_POLL_LENGTH                      0x00000001

#define _IOCON8_POLH_POSITION                    0x0000000D
#define _IOCON8_POLH_MASK                        0x00002000
#define _IOCON8_POLH_LENGTH                      0x00000001

#define _IOCON8_PENL_POSITION                    0x0000000E
#define _IOCON8_PENL_MASK                        0x00004000
#define _IOCON8_PENL_LENGTH                      0x00000001

#define _IOCON8_PENH_POSITION                    0x0000000F
#define _IOCON8_PENH_MASK                        0x00008000
#define _IOCON8_PENH_LENGTH                      0x00000001

#define _IOCON8_CLDAT0_POSITION                  0x00000002
#define _IOCON8_CLDAT0_MASK                      0x00000004
#define _IOCON8_CLDAT0_LENGTH                    0x00000001

#define _IOCON8_CLDAT1_POSITION                  0x00000003
#define _IOCON8_CLDAT1_MASK                      0x00000008
#define _IOCON8_CLDAT1_LENGTH                    0x00000001

#define _IOCON8_FLTDAT0_POSITION                 0x00000004
#define _IOCON8_FLTDAT0_MASK                     0x00000010
#define _IOCON8_FLTDAT0_LENGTH                   0x00000001

#define _IOCON8_FLTDAT1_POSITION                 0x00000005
#define _IOCON8_FLTDAT1_MASK                     0x00000020
#define _IOCON8_FLTDAT1_LENGTH                   0x00000001

#define _IOCON8_OVRDAT0_POSITION                 0x00000006
#define _IOCON8_OVRDAT0_MASK                     0x00000040
#define _IOCON8_OVRDAT0_LENGTH                   0x00000001

#define _IOCON8_OVRDAT1_POSITION                 0x00000007
#define _IOCON8_OVRDAT1_MASK                     0x00000080
#define _IOCON8_OVRDAT1_LENGTH                   0x00000001

#define _IOCON8_PMOD0_POSITION                   0x0000000A
#define _IOCON8_PMOD0_MASK                       0x00000400
#define _IOCON8_PMOD0_LENGTH                     0x00000001

#define _IOCON8_PMOD1_POSITION                   0x0000000B
#define _IOCON8_PMOD1_MASK                       0x00000800
#define _IOCON8_PMOD1_LENGTH                     0x00000001

#define _FCLCON8_FLTMOD_POSITION                 0x00000000
#define _FCLCON8_FLTMOD_MASK                     0x00000003
#define _FCLCON8_FLTMOD_LENGTH                   0x00000002

#define _FCLCON8_FLTPOL_POSITION                 0x00000002
#define _FCLCON8_FLTPOL_MASK                     0x00000004
#define _FCLCON8_FLTPOL_LENGTH                   0x00000001

#define _FCLCON8_FLTSRC_POSITION                 0x00000003
#define _FCLCON8_FLTSRC_MASK                     0x000000F8
#define _FCLCON8_FLTSRC_LENGTH                   0x00000005

#define _FCLCON8_CLMOD_POSITION                  0x00000008
#define _FCLCON8_CLMOD_MASK                      0x00000100
#define _FCLCON8_CLMOD_LENGTH                    0x00000001

#define _FCLCON8_CLPOL_POSITION                  0x00000009
#define _FCLCON8_CLPOL_MASK                      0x00000200
#define _FCLCON8_CLPOL_LENGTH                    0x00000001

#define _FCLCON8_CLSRC_POSITION                  0x0000000A
#define _FCLCON8_CLSRC_MASK                      0x00007C00
#define _FCLCON8_CLSRC_LENGTH                    0x00000005

#define _FCLCON8_IFLTMOD_POSITION                0x0000000F
#define _FCLCON8_IFLTMOD_MASK                    0x00008000
#define _FCLCON8_IFLTMOD_LENGTH                  0x00000001

#define _FCLCON8_FLTMOD0_POSITION                0x00000000
#define _FCLCON8_FLTMOD0_MASK                    0x00000001
#define _FCLCON8_FLTMOD0_LENGTH                  0x00000001

#define _FCLCON8_FLTMOD1_POSITION                0x00000001
#define _FCLCON8_FLTMOD1_MASK                    0x00000002
#define _FCLCON8_FLTMOD1_LENGTH                  0x00000001

#define _FCLCON8_FLTSRC0_POSITION                0x00000003
#define _FCLCON8_FLTSRC0_MASK                    0x00000008
#define _FCLCON8_FLTSRC0_LENGTH                  0x00000001

#define _FCLCON8_FLTSRC1_POSITION                0x00000004
#define _FCLCON8_FLTSRC1_MASK                    0x00000010
#define _FCLCON8_FLTSRC1_LENGTH                  0x00000001

#define _FCLCON8_FLTSRC2_POSITION                0x00000005
#define _FCLCON8_FLTSRC2_MASK                    0x00000020
#define _FCLCON8_FLTSRC2_LENGTH                  0x00000001

#define _FCLCON8_FLTSRC3_POSITION                0x00000006
#define _FCLCON8_FLTSRC3_MASK                    0x00000040
#define _FCLCON8_FLTSRC3_LENGTH                  0x00000001

#define _FCLCON8_FLTSRC4_POSITION                0x00000007
#define _FCLCON8_FLTSRC4_MASK                    0x00000080
#define _FCLCON8_FLTSRC4_LENGTH                  0x00000001

#define _FCLCON8_CLSRC0_POSITION                 0x0000000A
#define _FCLCON8_CLSRC0_MASK                     0x00000400
#define _FCLCON8_CLSRC0_LENGTH                   0x00000001

#define _FCLCON8_CLSRC1_POSITION                 0x0000000B
#define _FCLCON8_CLSRC1_MASK                     0x00000800
#define _FCLCON8_CLSRC1_LENGTH                   0x00000001

#define _FCLCON8_CLSRC2_POSITION                 0x0000000C
#define _FCLCON8_CLSRC2_MASK                     0x00001000
#define _FCLCON8_CLSRC2_LENGTH                   0x00000001

#define _FCLCON8_CLSRC3_POSITION                 0x0000000D
#define _FCLCON8_CLSRC3_MASK                     0x00002000
#define _FCLCON8_CLSRC3_LENGTH                   0x00000001

#define _FCLCON8_CLSRC4_POSITION                 0x0000000E
#define _FCLCON8_CLSRC4_MASK                     0x00004000
#define _FCLCON8_CLSRC4_LENGTH                   0x00000001

#define _TRIG8_TRGCMP_POSITION                   0x00000003
#define _TRIG8_TRGCMP_MASK                       0x0000FFF8
#define _TRIG8_TRGCMP_LENGTH                     0x0000000D

#define _TRIG8_TRGCMP0_POSITION                  0x00000003
#define _TRIG8_TRGCMP0_MASK                      0x00000008
#define _TRIG8_TRGCMP0_LENGTH                    0x00000001

#define _TRIG8_TRGCMP1_POSITION                  0x00000004
#define _TRIG8_TRGCMP1_MASK                      0x00000010
#define _TRIG8_TRGCMP1_LENGTH                    0x00000001

#define _TRIG8_TRGCMP2_POSITION                  0x00000005
#define _TRIG8_TRGCMP2_MASK                      0x00000020
#define _TRIG8_TRGCMP2_LENGTH                    0x00000001

#define _TRIG8_TRGCMP3_POSITION                  0x00000006
#define _TRIG8_TRGCMP3_MASK                      0x00000040
#define _TRIG8_TRGCMP3_LENGTH                    0x00000001

#define _TRIG8_TRGCMP4_POSITION                  0x00000007
#define _TRIG8_TRGCMP4_MASK                      0x00000080
#define _TRIG8_TRGCMP4_LENGTH                    0x00000001

#define _TRIG8_TRGCMP5_POSITION                  0x00000008
#define _TRIG8_TRGCMP5_MASK                      0x00000100
#define _TRIG8_TRGCMP5_LENGTH                    0x00000001

#define _TRIG8_TRGCMP6_POSITION                  0x00000009
#define _TRIG8_TRGCMP6_MASK                      0x00000200
#define _TRIG8_TRGCMP6_LENGTH                    0x00000001

#define _TRIG8_TRGCMP7_POSITION                  0x0000000A
#define _TRIG8_TRGCMP7_MASK                      0x00000400
#define _TRIG8_TRGCMP7_LENGTH                    0x00000001

#define _TRIG8_TRGCMP8_POSITION                  0x0000000B
#define _TRIG8_TRGCMP8_MASK                      0x00000800
#define _TRIG8_TRGCMP8_LENGTH                    0x00000001

#define _TRIG8_TRGCMP9_POSITION                  0x0000000C
#define _TRIG8_TRGCMP9_MASK                      0x00001000
#define _TRIG8_TRGCMP9_LENGTH                    0x00000001

#define _TRIG8_TRGCMP10_POSITION                 0x0000000D
#define _TRIG8_TRGCMP10_MASK                     0x00002000
#define _TRIG8_TRGCMP10_LENGTH                   0x00000001

#define _TRIG8_TRGCMP11_POSITION                 0x0000000E
#define _TRIG8_TRGCMP11_MASK                     0x00004000
#define _TRIG8_TRGCMP11_LENGTH                   0x00000001

